type1_test = [
    # "请问在2021年，中利集团的无形资产是多少元?",
    # "上海沿浦在2020年的营业外收入金额是多少元?",
    # "深圳光峰科技股份有限公司在2021年的应收款项融资金额是多少元？",
    # "维尔利环保科技集团股份有限公司2021年的衍生金融资产和其他非流动金融资产分别是多少元",
    # "融捷健康2020年综合收益总额是多少元?",
    # "中信重工机械股份有限公司在2019年的证券代码是什么?",
    # "2019年同花顺的企业名称是什么？",
    # "2019年唐山三孚硅业股份有限公司的证券简称是什么？",
    # "北部湾港股份有限公司在2020年的硕士是？",
    "胜华新材料集团股份有限公司在2019年的研发人员数是？",
    "中国国际海运集装箱（集团）股份有限公司2020年的电子邮箱是？",
    "西安陕鼓动力股份有限公司2019年公司网址是什么? ",
    # "上海贝岭股份有限公司2020年的法定代表人与2019年相比是否相同？",
    # "请问，东鹏饮料2021年的销售费用和管理费用分别是多少元?",
    # "国瓷材料在2019年的研发费用和财务费用分别是多少元？",
    # "请提供2019年东岳硅材的企业名称。",
    # "紫光国微在2019年的注册地址是什么？",
    # "生物股份2019年法定代表人是什么?",
]

type2_test = [
    "2021年新疆天富能源股份有限公司法定代表人与2020年相比是否都是相同的？",
    "2020年胜华新材总负债的增长率是多少?保留2位小数。",
    "2020年胜华新材研发人员数的增长率是多少?保留2位小数。",
    # "2019年胜华新材博士占职工人数比例是多少?保留2位小数。",
    # "2019年唐山三孚硅业股份有限公司的专科以下学历人数和本科以上人数的比值的增长率是什么？",
    # "2021年视觉(中国)文化发展股份有限公司无形资产增长率为多少?保留2位小数。",
    # "2021年万方发展的现金及现金等价物增长率是多少，保留两位小数。",
    # "奥精医疗科技股份有限公司2021年净利润增长率是多少?保留2位小数。",
    # "深圳市京基智农时代股份有限公司2021年每股收益和每股净资产分别是多少元?",
    # "太龙电子股份有限公司2019年研发经费以及销售费用的比是多少?保留2位小数。",
    # "莱茵生物2021年的研发人员数增长率是多少？保留2位小数。",
    # "2020年联化科技股份有限公司现金比率为多少?保留2位小数。",
    # "上海贝岭股份有限公司2020年的法定代表人与2019年相比是否相同？",
    # "海航创新股份有限公司在2021年的总资产增长率为多少?精确到小数点后两位。",
    # "2020年深南股份速动比率是多少?保留2位小数。",
    # "2021年鹏都农牧股份有限公司无形资产增长率为多少?保留2位小数。",
    # "请问，海正药业在2021年的现金及现金等价物增长率是多少？请保留两位小数。",
    # "在2021年，浙江东日的每股收益和每股净资产分别是多少元?",
    # "深圳市京基智农时代股份有限公司2021年每股收益和每股净资产分别是多少元?",
    # "华西股份2021年的投资收益增长率是多少？请保留两位小数。",
    # "2020年北部湾港企业硕士及以上人员占职工人数的比例是多少？请保留两位小数。",

]

type31_test = [
    "请根据江化微2019年的年报，简要介绍报告期内公司主要销售客户的客户集中度情况，并结合同行业情况进行分析。",
    "能否根据2020年金宇生物技术股份有限公司的年报，给我简要介绍一下报告期内公司的社会责任工作情况？",
    "请简要分析天津七一二通信广播股份有限公司2019年聘任、解聘会计师事务的情况。",
    "请简要分析天津七一二通信广播股份有限公司2019年的研发投入情况。",
    "能否根据2020年金宇生物技术股份有限公司的年报，分析一下该公司的盈利模式",
]

type32_test = [
    "什么是每股收益？",
]

all_test = type1_test + type2_test + type31_test + type32_test