alias_dict = {
    '资产总计': ['资产总额', '资产合计'],
    "研发费用": ['研发经费'],
    "收回投资收到的现金": ["收回投资所收到的现金", "收回的投资收到的现金"],
    "期末现金及现金等价物余额": ["现金及现金等价物余额", "期末的现金及现金等价物余额", "现金及现金等价物"],
    "净利润": ["利润", "收益"],
    "职工总数": ["员工总数", "职工人数", "员工人数", "职工总人数"],
    "所有者权益合计": ["净资产"],
    "经营活动产生的现金流量净额": ["经营现金流量"],
    "电子信箱": ["电子邮箱地址", "电子邮箱"],
    "基本每股收益": ["每股收益"],
    "负债合计": ["总负债", "负债总计"],
    "归属于母公司股东的净利润": ["归属于母公司所有者的净利润"],
    "外文名称": ["英文名称"],
    "网址": ["互联网地址", "公司网址"],
    "本科": ["大学"],
    "专科": ["大专"],
    "公司名称": ["企业名称"],
    "股票简称": ["证券简称"],
    "股票代码": ["证券代码"],
    "股份总数": ["总股本"],
    "无形资产": ["无形资产总额"],
    "货币资金": ["货币总额"],
    "资产总计": ["总资产", "资产总额", "资产合计"],
    "流动负债合计": ["流动负债"],
    "非流动负债合计": ["非流动负债"],
    "股本": ["实收资本"],
    "流动资产合计": ["流动资产"],
    "非流动资产合计": ["非流动资产"]
}

alias_inv_dict = {}
for k, v in alias_dict.items():
    for u in v:
        alias_inv_dict[u] = k