[
    {
        "问题": "请简要介绍2020年上海安硕信息技术股份有限公司审计意见情况。",
        "检索内容": "审计意见：\n我们审计了上海安硕信息技术股份有限公司（以下简称“贵公司”）的财务报表，包括2020年12月31日的合并及母公司资产负债表，2020年度的合并及母公司利润表、合并及母公司现金流量表、合并及母公司股东权益变动表，以及财务报表附注。我们认为，后附的财务报表在所有重大方面按照企业会计准则的规定编制，公允反映了贵公司2020年12月31日的合并及母公司财务状况以及2020年度的合并及母公司经营成果和现金流量。\n\n审计报告：\n审计意见类型\t标准的无保留意见\n审计报告签署日期\t2021年04月26日\n审计机构名称\t大信会计师事务所（特殊普通合伙）\n审计报告文号\t大信审字[2021]第4-00344号\n注册会计师姓名\t张静娟、毕文涛\n审计报告正文审计报告大信审字[2021]第4-00344号上海安硕信息技术股份有限公司全体股东：\n",
        "回答": "根据提供的信息，2020年上海安硕信息技术股份有限公司的审计意见如下：\n\n审计意见类型：标准的无保留意见。这表示审计师认为财务报表在所有重大方面按照企业会计准则的规定进行编制，公允反映了公司截止到2020年12月31日的合并及母公司财务状况，以及2020年度的合并及母公司经营成果和现金流量。\n\n审计报告签署日期：2021年04月26日。\n\n审计机构名称：大信会计师事务所（特殊普通合伙）。\n\n审计报告文号：大信审字[2021]第4-00344号。\n\n注册会计师姓名：张静娟、毕文涛。\n\n总的来说，审计意见表明上海安硕信息技术股份有限公司的2020年度财务报表经过审计，并且在审计师看来，这些报表合乎会计准则的规定，准确地反映了公司的财务状况和经营成果。审计师未发现任何需要强调或保留的事项，因此给出了标准的无保留意见，这是一个积极的审计结论。这意味着公司的财务报表在审计过程中未出现重大问题，对投资者和利益相关者提供了可靠的财务信息。"
    },{
        "问题": "请简要介绍2019年幸福蓝海影视文化集团股份有限公司审计意见情况。",
        "检索内容": "审计报告：\n审计意见类型\t保留意见\n审计报告签署日期\t2020年04月07日\n审计机构名称\t苏亚金诚会计师事务所（特殊普通合伙）\n审计报告文号\t苏 亚 审 [2020] 183 号\n注册会计师姓名\t周家文、尤文波\n审计报告正文幸福蓝海影视文化集团股份有限公司全体股东：\n\n关键审计事项：\n1.收入确认\n请参阅财务报表附注三“重要会计政策和会计估计”注释二十一所述的会计政策及附注五“合并财务报表主要项目注释”注释32。关键审计事项\n幸福蓝海主要从事电视剧的制作、发行，电影院线和影城的经营及电影相关的广告经营。2019年度幸福蓝海确认的营业收入为213,808.79万元，主要包括电视剧发行收入48,862.81万元，院线发行及放映\n收入137,931.26万元。由于收入是幸福蓝海的关键业绩指标之一，从而存在为了达到特定目标或期望而操纵收入确认时点的固有风险，我们将幸福蓝海收入确认确定为关键审计事项。\t时点进行了分析评价，了解和评价销售收入确认政策。· 我们结合业务板块、行业发展和幸福蓝海实际情况，执行分析程序，判断各板块收入变动的合理性。· 获取关联方销售合同，检查关联方销售收入的确认条件、方法是否符合企业会计准则，前后期是否一致；检查关联方交易是否经过授权，交易价格是否合理。· 检查与影视剧收入确认相关的支持性文件，包括销售合同、供带证明、销售发票等；对重大的新增客户和关联方销售业务执行函证等程序。· 抽查院线公司下属各影城在国家专资平台上的票房收入，将其与院线系统编制的统计报表进行核对，根据确定的分账比例计算院线的分账收入，并与账面记录进行核对。· 检查全部影城账面放映收入，与售票系统数据进行核对，并将影院票房收入与国家专资平台上的票房收入进行核对。· 就资产负债表日前后记录的收入交易，选取样本，核对合同及其他支持性文件，以评价收入是否被记录于恰当的会计期间。\n2、应收账款的确认\t\n请参阅财务报表附注三“重要会计政策和会计估计”注释九所述的会计政策及附注五“合并财务报表主要项目注释”注释3。\t\n关键审计事项\t在审计中如何应对该事项\n应收账款于2019年12月31日余额65,398.46万元，坏账准备金额24,762.45万元，账面价值为40,636.01万元，占合并财务报表资产总额的15.88%。账面价值较高，若应收账款不能按期收回或无法收回而发生坏账对财务报表影响较为重大，为此我们确定应收账款的坏账准备为关键审计事项。\t我们针对应收账款的坏账准备执行的主要审计程序包括：· 了解和评价幸福蓝海的信用政策及计提预期信用损失相关内部控制设计的有效性，并测试关键控制运行的有效性。· 对于按组合计提预期信用损失的应收账款，评估管理层编制的风险矩阵是否符合预期信用损失模型，对风险矩阵中的关键输入值进行测算，主要包括：逾期账龄、迁徙率、历史损失率、前瞻性信息等。· 对于单项计提预期信用损失的应收账款，选取样本复核管理层对预计未来可获得的现金流量所做评估的依据及合理性；· 我们选取样本对金额重大的应收账款余额实施了函证程序，并将函证结果与幸福蓝海记录的金额进行了核对。· 检查应收账款期后回款情况，评价应收账款信用损失的合理性· 分析计算幸福蓝海资产负债表日应收账款预计信用损失与应收账款余额之间的比率，与国内的其他上市公司公开披露的信息进行比较，对幸福蓝海应收账款预计信用损失占应收账款余额比例的总体合理性进行了评估。· 评价管理层对应收账款坏账准备在财务报告中的披露是否恰当。\n\n",
        "回答": "根据2019年幸福蓝海影视文化集团股份有限公司的审计报告，审计意见情况如下：\n\n审计意见类型：保留意见。这意味着审计师在审计过程中发现了某些问题或关键审计事项，但问题不足以导致无法发表意见。审计师提出了关于特定事项的保留意见。\n\n审计报告签署日期：2020年04月07日。\n\n审计机构名称：苏亚金诚会计师事务所（特殊普通合伙）。\n\n审计报告文号：苏 亚 审 [2020] 183 号。\n\n注册会计师姓名：周家文、尤文波。\n\n关键审计事项：\n\n审计报告提到了两个关键审计事项，它们是在审计过程中特别重要的事项，需要更多的审计工作和关注。这两个关键审计事项是：\n\n收入确认：因为收入是公司的关键业绩指标之一，存在操纵收入确认时点的风险。审计师对公司的收入确认政策进行了详细审计，包括对销售合同、供带证明、销售发票等支持性文件的检查，以评估收入是否按照企业会计准则的规定正确确认。此外，审计师还检查了院线公司下属各影城的票房收入，并与国家专资平台上的票房收入进行核对，以确保准确性。\n\n应收账款的确认：应收账款是公司的重要资产之一。审计师关注了应收账款的坏账准备，因为坏账准备的不足可能对财务报表产生较大影响。审计师进行了信用政策、信用损失模型、应收账款回款情况等多方面的审计程序，以评估坏账准备的合理性。\n\n总的来说，审计报告表明在审计过程中存在一些关键审计事项，尤其是涉及收入确认和应收账款的审计。尽管审计师提出了保留意见，但这并不意味着公司的财务报表不可靠，而是在审计中发现了一些需要特别关注的问题。公司在审计意见发表后可能会采取措施来解决这些问题。"
    }
]